# Issue 9480: Sage mixes Infinity and +Infinity

archive/issues_009480.json:
```json
{
    "body": "This is related to #8942. The limit function can output either\n`+Infinity`, `-Infinity`, or `Infinity`, the later\nmeaning a complex infinity. For example:\n\n```\nsage: limit(1/x, x=0, dir='above')\n+Infinity\nsage: limit(1/x, x=0, dir='below')\n-Infinity\nsage: limit(1/x, x=0)             \nInfinity\n```\nHowever Sage does not distinguish `+Infinity` and `Infinity`:\n\n```\nsage: l1=limit(1/x, x=0, dir='above')\nsage: l2=limit(1/x, x=0, dir='below')\nsage: l3=limit(1/x, x=0)\nsage: l1==l3\nTrue\n```\n\n**Assignee:** @robertwb\n\n**Keywords:** infinity, equality\n\nIssue created by migration from https://trac.sagemath.org/ticket/9480\n\n",
    "closed_at": "2014-01-03T09:36:30Z",
    "created_at": "2010-07-12T12:48:51Z",
    "labels": [
        "component: coercion",
        "bug",
        "invalid"
    ],
    "title": "Sage mixes Infinity and +Infinity",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/9480",
    "user": "https://github.com/zimmermann6"
}
```
This is related to #8942. The limit function can output either
`+Infinity`, `-Infinity`, or `Infinity`, the later
meaning a complex infinity. For example:

```
sage: limit(1/x, x=0, dir='above')
+Infinity
sage: limit(1/x, x=0, dir='below')
-Infinity
sage: limit(1/x, x=0)             
Infinity
```
However Sage does not distinguish `+Infinity` and `Infinity`:

```
sage: l1=limit(1/x, x=0, dir='above')
sage: l2=limit(1/x, x=0, dir='below')
sage: l3=limit(1/x, x=0)
sage: l1==l3
True
```

**Assignee:** @robertwb

**Keywords:** infinity, equality

Issue created by migration from https://trac.sagemath.org/ticket/9480





---

archive/issue_events_070217.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2010-08-29T10:54:14Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "milestone": "sage-4.5.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70217"
}
```



---

archive/issue_comments_083688.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis is more of a problem with the equality checking rules in Sage and the coercion system than symbolics, so I'm changing the component to coercion.\n\nIf the arguments compare equal when coerced to a common parent, Sage returns `True` for the equality. In this case, the coercion goes to the `UnsignedInfinityRing`, where `+Infinity` is mapped to `unsigned_infinity`.\n\n```\nsage: UnsignedInfinityRing.has_coerce_map_from(InfinityRing)\nTrue\nsage: Infinity\n+Infinity\nsage: UnsignedInfinityRing.coerce(Infinity)\nInfinity\n```\n\nBTW, isn't there an inconsistency in the capitalization of `Infinity`. Shouldn't it be lowercase according to Python conventions?",
    "created_at": "2010-08-29T10:54:14Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83688",
    "user": "https://github.com/burcin"
}
```

<a id='comment:1'></a>
This is more of a problem with the equality checking rules in Sage and the coercion system than symbolics, so I'm changing the component to coercion.

If the arguments compare equal when coerced to a common parent, Sage returns `True` for the equality. In this case, the coercion goes to the `UnsignedInfinityRing`, where `+Infinity` is mapped to `unsigned_infinity`.

```
sage: UnsignedInfinityRing.has_coerce_map_from(InfinityRing)
True
sage: Infinity
+Infinity
sage: UnsignedInfinityRing.coerce(Infinity)
Infinity
```

BTW, isn't there an inconsistency in the capitalization of `Infinity`. Shouldn't it be lowercase according to Python conventions?



---

archive/issue_comments_083689.json:
```json
{
    "body": "**Changing assignee** from @burcin to @robertwb.",
    "created_at": "2010-08-29T10:54:14Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83689",
    "user": "https://github.com/burcin"
}
```

**Changing assignee** from @burcin to @robertwb.



---

archive/issue_comments_083690.json:
```json
{
    "body": "**Changing keywords** from \"\" to \"infinity, equality\".",
    "created_at": "2010-08-29T10:54:14Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83690",
    "user": "https://github.com/burcin"
}
```

**Changing keywords** from "" to "infinity, equality".



---

archive/issue_events_070218.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2010-08-29T10:54:14Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "component: calculus",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70218"
}
```



---

archive/issue_events_070219.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2010-08-29T10:54:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "component: coercion",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70219"
}
```



---

archive/issue_comments_083691.json:
```json
{
    "body": "<a id='comment:2'></a>\nSometimes it's `infinity` and others its `Infinity`. At the very least this should be consistent. Also there are other issues with infinity: #11506 #9547.",
    "created_at": "2012-05-11T13:39:10Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83691",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:2'></a>
Sometimes it's `infinity` and others its `Infinity`. At the very least this should be consistent. Also there are other issues with infinity: #11506 #9547.



---

archive/issue_events_070220.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "milestone": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70220"
}
```



---

archive/issue_events_070221.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70221"
}
```



---

archive/issue_comments_083692.json:
```json
{
    "body": "<a id='comment:4'></a>\nin Sage 5.11 we get:\n\n```\nsage: l1=limit(1/x, x=0, dir='right'); l1\n+Infinity\nsage: l2=limit(1/x, x=0, dir='left'); l2 \n-Infinity\nsage: l3=limit(1/x, x=0); l3             \nInfinity\nsage: bool(l1==l2), bool(l2==l3), bool(l3==l1)\n(False, False, False)\n```\nhowever the objects returned are in SR and not in the `infinity` class:\n\n```\nsage: type(l1), l1.parent()\n(sage.symbolic.expression.Expression, Symbolic Ring)\nsage: p1=+Infinity\nsage: type(p1), p1.parent()\n(sage.rings.infinity.PlusInfinity, The Infinity Ring)\n```\nI propose to close that ticket, and open a new one about the above issue (or add it to an existing ticket).\n\nPaul",
    "created_at": "2013-08-25T13:45:01Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83692",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:4'></a>
in Sage 5.11 we get:

```
sage: l1=limit(1/x, x=0, dir='right'); l1
+Infinity
sage: l2=limit(1/x, x=0, dir='left'); l2 
-Infinity
sage: l3=limit(1/x, x=0); l3             
Infinity
sage: bool(l1==l2), bool(l2==l3), bool(l3==l1)
(False, False, False)
```
however the objects returned are in SR and not in the `infinity` class:

```
sage: type(l1), l1.parent()
(sage.symbolic.expression.Expression, Symbolic Ring)
sage: p1=+Infinity
sage: type(p1), p1.parent()
(sage.rings.infinity.PlusInfinity, The Infinity Ring)
```
I propose to close that ticket, and open a new one about the above issue (or add it to an existing ticket).

Paul



---

archive/issue_events_070222.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2013-08-25T13:45:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70222"
}
```



---

archive/issue_comments_083693.json:
```json
{
    "body": "<a id='comment:5'></a>\n> or add it to an existing ticket\n\nI've added a comment in #14857\n\nPaul",
    "created_at": "2013-08-25T13:59:34Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83693",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:5'></a>
> or add it to an existing ticket

I've added a comment in #14857

Paul



---

archive/issue_events_070223.json:
```json
{
    "actor": "https://github.com/nathanncohen",
    "created_at": "2013-12-26T19:26:33Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70223"
}
```



---

archive/issue_events_070224.json:
```json
{
    "actor": "https://github.com/nathanncohen",
    "created_at": "2013-12-26T19:26:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "needs info",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70224"
}
```



---

archive/issue_comments_083694.json:
```json
{
    "body": "<a id='comment:6'></a>\nNo patch to review on this ticket...\n\nPaul : when you want to close a ticket, you should set its milestone to wontfix/duplicate, say why on a comment, and change the status to `positive_review` so that the release manager will see it.\n\nNathann",
    "created_at": "2013-12-26T19:26:33Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83694",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:6'></a>
No patch to review on this ticket...

Paul : when you want to close a ticket, you should set its milestone to wontfix/duplicate, say why on a comment, and change the status to `positive_review` so that the release manager will see it.

Nathann



---

archive/issue_comments_083695.json:
```json
{
    "body": "<a id='comment:7'></a>\nin Sage 6.0 we get:\n\n```\nsage: l1=limit(1/x, x=0, dir='above')\nsage: l3=limit(1/x, x=0)\nsage: bool(l1==l3)\nFalse\n```\nthus the issue is fixed now, and I change the status to \"fixed\".\n\nPaul",
    "created_at": "2014-01-03T09:36:30Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83695",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:7'></a>
in Sage 6.0 we get:

```
sage: l1=limit(1/x, x=0, dir='above')
sage: l3=limit(1/x, x=0)
sage: bool(l1==l3)
False
```
thus the issue is fixed now, and I change the status to "fixed".

Paul



---

archive/issue_events_070225.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2014-01-03T09:36:30Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "label": "needs info",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70225"
}
```



---

archive/issue_events_070226.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2014-01-03T09:36:30Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70226"
}
```



---

archive/issue_comments_083696.json:
```json
{
    "body": "<a id='comment:8'></a>\nsorry when changing to \"fixed\" (which made more sense to me than invalid or wontfix) the status was changed automatically to \"closed\"...\n\nPaul",
    "created_at": "2014-01-03T09:38:05Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83696",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:8'></a>
sorry when changing to "fixed" (which made more sense to me than invalid or wontfix) the status was changed automatically to "closed"...

Paul



---

archive/issue_comments_083697.json:
```json
{
    "body": "<a id='comment:9'></a>\nI also verified that it works in `6.1.beta2`.",
    "created_at": "2014-01-03T15:09:06Z",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9480#issuecomment-83697",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:9'></a>
I also verified that it works in `6.1.beta2`.



---

archive/issue_events_070227.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2014-01-03T15:09:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/9480",
    "milestone": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9480#event-70227"
}
```
